CSI API ETABS v1
cFile.NewBlank Method
 Creates a new, blank model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int NewBlank()
Function NewBlank As Integer
Dim instance As cFile
Dim returnValue As Integer
returnValue = instance.NewBlank()
int NewBlank()
abstract NewBlank : unit -> int
Return Value
Type: Int32
 Returns zero if the new blank model is successfully created, otherwise it returns a nonzero value.
Remarks
 Do not use this function to add to an existing model. This function should be used only for creating a new model and typically would be preceded by calls to ApplicationStart or InitializeNewModel(eUnits).
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create a blank model from template
       ret = SapModel.File.NewBlank()
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cFile Interface
ETABSv1 Namespace